results/qwen-3.5/qwen-3.5-0.8b/bf16/08-sharegpt.log
<frozen importlib._bootstrap_external>:1297: FutureWarning: The cuda.cudart module is deprecated and will be removed in a future release, please switch to use the cuda.bindings.runtime module instead.
<frozen importlib._bootstrap_external>:1297: FutureWarning: The cuda.nvrtc module is deprecated and will be removed in a future release, please switch to use the cuda.bindings.nvrtc module instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe7d7347eb240>, trust_remote_code=False, seed=42, num_prompts=250, dataset_name='sharegpt', no_stream=False, dataset_path='/tmp/ShareGPT_V3.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=None, model='Qwen/Qwen3.5-0.8B', input_len=None, output_len=None, tokenizer='Qwen/Qwen3.5-0.8B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=0.3, burstiness=0.7, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/tmp', result_filename='08-sharegpt.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-aea422db-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='qwen3.5-0.8b-bf16', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 0.3
Burstiness factor: 0.7 (Gamma distribution)
Maximum request concurrency: None
100%|██████████| 250/250 [13:54<00:00,  3.34s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     250       
Failed requests:                         0         
Request rate configured (RPS):           0.30      
Benchmark duration (s):                  834.71    
Total input tokens:                      57729     
Total generated tokens:                  50063     
Request throughput (req/s):              0.30      
Output token throughput (tok/s):         59.98     
Peak output token throughput (tok/s):    638.00    
Peak concurrent requests:                6.00      
Total token throughput (tok/s):          129.14    
---------------Time to First Token----------------
Mean TTFT (ms):                          35.83     
Median TTFT (ms):                        35.69     
P50 TTFT (ms):                           35.69     
P90 TTFT (ms):                           48.48     
P95 TTFT (ms):                           51.40     
P99 TTFT (ms):                           69.59     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          8.45      
Median TPOT (ms):                        8.49      
P50 TPOT (ms):                           8.49      
P90 TPOT (ms):                           8.74      
P95 TPOT (ms):                           8.83      
P99 TPOT (ms):                           9.24      
---------------Inter-token Latency----------------
Mean ITL (ms):                           8.33      
Median ITL (ms):                         8.31      
P50 ITL (ms):                            8.31      
P90 ITL (ms):                            9.39      
P95 ITL (ms):                            9.77      
P99 ITL (ms):                            10.64     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          1703.93   
Median E2EL (ms):                        1103.98   
P50 E2EL (ms):                           1103.98   
P90 E2EL (ms):                           4142.98   
P95 E2EL (ms):                           5470.40   
P99 E2EL (ms):                           6789.68   
==================================================